# Setup brew casks
cask_args appdir: '/Applications'
tap 'homebrew/cask-fonts'

brew 'mas'
brew 'asdf'
brew 'neovim'
brew 'powerlevel10k'

cask '1password'
cask 'iterm2'
cask 'google-chrome'
cask 'firefox'
cask 'deezer'
cask 'rancher'
cask 'signal'
cask 'whatsapp'
cask 'pocket-casts'

cask 'font-caskaydia-cove-nerd-font'

mas 'PDFScanner', id: 410968114
mas '1Password for Safari', id: 1569813296
mas 'AdGuard for Safari', id: 1440147259
